# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rake db:seed (or created alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)

News.create([ { title: "首个众筹模式的DOTA2电竞联赛", content: "
i联赛创国内首国众筹模式的DOTA2电竞联赛，“i联赛”是由喜欢游戏的玩家一起筹措比赛所需资金，由ImbaTV来制作和播出的电子竞技联赛。“i”是ImbaTV的首字母，代表着ImbaTV自主打造的电子竞技联赛。首届i联赛以众筹总额1692620元的成绩，创造了国内动漫行业众筹数字的纪录。而随着第二届i联赛的完美收官，及破百万的收视数据，我们再次见证了中国Dota2玩家的力量！"},
              { title: "imbaTV出品 DOTA2 第二届 i 联赛专题报道", content: "在第一届i-league（i联赛）收获了巨大成功之后，imbaTV荣誉出品的第二届i联赛再度重燃战火，本届i联赛分美洲区（1个名额）、欧洲区（2个名额）、东南亚区（1个名额）和中国区（4个名额，上届冠军VG直接进入总决赛）4个赛区进行预选赛，届时共8支队伍角逐冠军头衔。大战一触即发，冠军究竟花落谁家，敬请期待第二届i联赛!"},
              { title: "ImbaTV海涛：游戏主播年薪超千万 多是夸大其辞", content: "日前，媒体采访了原Games TV游戏风云频道主持人，现ImbaTV创办者海涛(微博)，探秘游戏主播千万年薪背后的行业浮夸。《双城记》曾经写道：“这是一个最好的时代，这是一个最坏的时代”，手游时代下的游戏主播，这又是一个怎么样的时代？

ImbaTV海涛：游戏主播年薪超千万 多是夸大其辞

解说中的海涛

游戏主播年薪超千万：这是最好的时代？

最近有传游戏主播年薪超千万，你怎么看待这种现象？

“这挺多是夸大其辞，虽然有一些的签约收入很高，但主要是在直播平台这一块，这是在直播行业处于资本风口时特定时期的特定现象，并不是所有人从事游戏主播都能有这个身价，这个身价也不是会一直保持下去。”

海涛目前与合作伙伴创业了ImbaTV，他介绍他的收入除了主播，还与视频、做活动、开网店等挂钩。据百度资料介绍，当年海涛的优酷视频解说点击量几乎是所有解说视频排行首位。同样来自百度的资料介绍显示：海涛的网店四皇冠，年销售额突破千万。“游戏主播开网店是一个变现的方式，很多主持人也做网店，电竞这块应该是我最先做起来的吧。”

海涛认为：“游戏主播的收入这几年是不错了，但至于是不是最好的时代，不能简单的以收入是否够高来判断。游戏主播千万年薪现象其实在外国也有，但外国的生态相对会正常一些，他们的收入是可持续发展的收入，而我们目前很多的收入不是可持续发展的收入，这是有本质区别的。”"},
              { title: "ImbaTV游戏麦霸我最6 涛哥盆腔共鸣式唱功", content: "ImbaTV大型音乐类综艺娱乐节目《游戏麦霸我最6》第一期节目首播，节目将邀请10位来自游戏圈的麦霸们来一起同台竞技，最终的总冠军将获得1万元的奖金以及一张个人单曲CD的录制。首期节目邀请了来自war3的世界冠军塔魔Infi，王诩文同志果然唱功非凡，节目最后海涛还演示了一番盆腔共鸣的唱功，一起来看吧。"},
              { title: "IMBATV游戏麦霸我最6热播 囚徒鬼鬼献唱", content: "近期，一档名为游戏麦霸我最6的节目悄然热播，该节目由ImbaTV主办，邀请游戏界的主播和明星选手演唱歌曲，并由评委和粉丝投票，节目互动性和娱乐性都很高。
游戏麦霸我最6作为史上第一档电竞音乐类节目，邀请了诸多知名电竞明星和游戏主播，包括war3选手infi,灵魂歌手马甲哥等。"},
              { title: "众筹回馈再升级！第二届i联赛众筹奖励揭秘", content: "IMBATV对参与第二届联赛众筹玩家的回馈方式已经出炉，让我们一探究竟。

   10元档
您将获得以下众筹回报
1、《i联赛》线下赛免费入场门票；
2、《i联赛》直播片尾名单滚屏；
3、《i联赛》专属Dota2客户端免费观战门票＋loading图＋游戏界面

100元档
您将获得以下众筹回报
1、《i联赛》线下赛免费入场门票；
2、《i联赛》直播片尾名单滚屏；
3、《i联赛》专属Dota2客户端免费观战门票＋loading图＋游戏界面；
4、《i联赛》纪念徽章;
I-ROCKS ImbaTV定制鼠标垫。


500元档
您将获得以下众筹回报
1、《i联赛》线下赛免费入场门票；
2、《i联赛》直播片尾名单滚屏；
3、《i联赛》专属Dota2客户端免费观战门票＋loading图＋游戏界面
4、《i联赛》定制Dota2游戏套装；
5、《i联赛》纪念徽章;
6、《i联赛》线下总决赛阶段队伍＋主持人签名鼠标垫(现场发放)；
7、I-ROCKS IM5-DK战队特供版鼠标；
8、线下总决赛期间与ImbaTV知名主持人共进晚餐，给《i联赛》发展出谋划策。



 
1000元档
您将获得以下众筹回报
1、《i联赛》线下赛VIP门票；
2、《i联赛》直播片尾名单滚屏；
3、《i联赛》专属Dota2客户端免费观战门票＋loading图＋游戏界面
4、《i联赛》定制Dota2游戏套装；
5、《i联赛》纪念徽章;
6、《i联赛》线下总决赛阶段队伍＋主持人签名鼠标垫(现场发放)；
7、I-ROCKS IM5-DK战队特供版鼠标＋I-ROCKS IH05耳机;
8、线下总决赛期间与ImbaTV知名主持人共进晚餐，给《i联赛》发展出谋划策。





 

5000元档

您将获得以下众筹回报

1、《i联赛》线下赛VIP门票；

2、《i联赛》直播片尾名单滚屏；

3、《i联赛》专属Dota2客户端免费观战门票＋loading图＋游戏界面

4、《i联赛》定制Dota2游戏套装；

5、《i联赛》纪念徽章;

6、《i联赛》线下总决赛阶段队伍＋主持人签名鼠标垫(现场发放)；

7、I-ROCKS IM5-DK战队特供版鼠标＋I-ROCKS IH05耳机＋I-ROCKS KR-6260  键盘；

8、《i联赛》定制迪锐克斯DXRACER限量款专业电竞座椅；

9、线下总决赛期间与ImbaTV知名主持人共进晚餐，给《i联赛》发展出谋划策;

10、线下总决赛期间登台与广大观众见面并参与现场水友赛互动。


 

本次回报更新吸纳了部分第一届i联赛支持者的建议，除了实物奖励外，还增加了部分和解说互动、选手互动的机会。Dota2游戏内的定制道具正在和v社做最后的确认，ImbaTV也将在近期跟大家公布详情。

《i联赛》是我们的起点，他承载着我们的梦想，我们会从细节做起，希望能联合各方完美地呈现给大家！

想要拿到精美的回馈吗？赶紧登陆http://imbatv.modian.com,参与第二届i联赛的众筹吧！"},
              { title: "必须nuibility!暴漫张全蛋空降ImbaTV", content: "张全蛋来啦！

　　暴走漫画与ImbaTV正式展开深度合作，本周日（1月25日）下午16点，张全蛋将会空降ImbaTV演播室，为各位带来他第一视角的英雄联盟游戏直播。之后每周还会有其他暴漫明星陆续在ImbaTV演播室中出现，ImbaTV以及暴漫的粉丝请务必关注每周的直播内容。


 

 

　　周日，我们不见不散！"},
              { title: "约战浅水湾！第二届i联赛总决赛1月10日开打", content: "约战浅水湾！第二届i联赛总决赛1月10日开打



imbatv第二届i联赛总决赛将于1月10日在浅水湾文化艺术中心开打！VG是否能卫冕冠军？LGD和HGT是否能成为i联赛的新科冠军？让我们拭目以待！


众筹玩家优先入场

第二届i联赛已经接近尾声，为了进一步回报广大众筹玩家在赛事组织之初对 i 联赛、ImbaTV的支持，第二届 i 联赛线下总决赛（1月10日）仅供众筹玩家现场观战！剩余位置才对其他等待玩家开放。

入场方式不变

和第一届i联赛的入场方式一样，第二届众筹玩家当日凭摩点网注册信息（凭摩点网注册的ID、姓名、手机号码验证入场）在入口处领取腕带，凭此进入现场观赛。1月10日下午15:00众筹玩家开始优先入场，15:45起将按照剩余位置数量安排其他玩家依次入场。



浅水湾文化艺术中心

第二届i联赛总决赛将在浅水湾文化艺术中心Q.HALL大剧场开打，浅水湾文化艺术中心地处繁华的江宁路段，附近交通也十分便利，地铁3、4、7号线；公交112、206、68、76、105、801、830、19等线路均可抵达。

总决赛地址：上海市普陀区宜昌路179号（近江宁路） 浅水湾文化艺术中心 Q.Hall。"},
              { title: "第二届i联赛BG战队退赛公告", content: "我们遗憾的得知，由于BG战队顶替B神参赛的CDEC教练童军杰（mikasa)要带队赴美参赛，无法继续参加之后的i联赛8强线下赛胜者组比赛，因此BG战队将弃权之后的比赛，他们的对手将默认为2:0获胜，而8强中VG与HGT的胜者也将直接晋级胜者组决赛。




 
上图为BG队员张宁（xiao8)发表关于弃权的微博。

                                                                    i联赛组委会
                                                                        2015.1.2"},
              { title: "i联赛关于取消Cloud9禁赛一季判罚的声明", content: "1、在i联赛第二赛季筹办初期，由于比赛奖金众筹的性质，我们并不能确定本赛季最终奖金金额是多少，我们在给ACE联盟发送的赛事报备信息中没有明确写明第二赛季的奖金数额，只说明了各个名次的奖金比例，只是在最后附带了上赛季奖金大概30W美金左右仅供参考，这也造成了一个非常大的误会就是发给EG邀请邮件的翻译同学误以为本赛季也是30W美金的奖金（这确实是我们的工作不严谨造成的，翻译同学是无辜的），随后国内和gosugamer上的新闻我们检查过都没有问题，但我们没有看到2p.com上错误的新闻，这都是我们工作上的失误和不足，对此造成的误会我们深表歉意，并保证在以后的工作中不再犯类似的错误。

　　2、取消cloud9禁赛一季的处罚，接受本赛季的cloud9退赛的决定，并对cloud9受到的影响表示歉意。

　　3、i联赛的奖金构成：基础奖金10万人民币+众筹奖金（目标100万，70%作为奖金）+门票收入（除去饰品作者分成其余全部作为奖金）

　　最后，由于i联赛的众筹模式是一次全新的尝试，我们仍在摸索阶段，当中存在很多不足，也有很多意外情况的发生，在此对各位玩家、粉丝的支持表示感谢，我们非常重视大家提出的宝贵意见，比如游戏内置道具的反馈，比如和V社、完美的合作，这些我们都会一一反思讨论，寻找改进的途径，为大家带来一个更好的赛事，通过赛事给大家带来更多的乐趣。

i联赛组委会　　

2014.12.22　"},
              { title: "趣分期宣布赞助25万 携手i-rocks助力i联赛", content: "自i联赛第二赛季众筹开始以来，不仅依旧得到了广大玩家们和外设品牌i-rocks的大力支持，还得到了来自新兴企业趣分期的鼎立赞助，众筹金额已经达到预期的一半,超过50万元的大关。

我们有理由相信，随着更多玩家们的加入，第一届i 联赛所创造的众筹记录不是一个目标，而是一个起点，这个数字不单单会代表着更高的奖金，更代表着玩家们和i联赛一起越办越好，让更多的非游戏玩家和更多的厂商们了解我们，加入我们，而我们将会以最好的回馈回报给每一个为i 联赛奉献过的玩家和赞助商们。

参与众筹及了解i联赛信息请点击：http://imbatv.modian.com

进度已过半 50天众筹额超50万

9月9号i联赛第二赛季开启众筹，70天内，已经收到了来自玩家超过15万的众筹支持，另外，上赛季的赞助商i-rocks也在第一时间参与了特约赞助，赞助金额高达15万和额外的实物奖品。目前总金额64万中有一大半是来自另一家赞助商“趣分期”的鼎力赞助。这也是趣分期首次参与到电竞赛事中。


第二家赞助商 趣分期联手IMBATV

作为一家新兴企业，“趣分期”在观看了i联赛第一赛季的火爆盛况后，发现i联赛的观众和趣分期的目标用户非常契合。他们在得知第二赛季开启后，在第一时间联系了IMBATV并成为了i联赛的第二家特约赞助商。

趣分期的市场负责人表示：我们是一家迅速成长的企业，而IMBATV也是一家快速崛起的电竞媒体。大家在各种的领域做的都很成功，而我们的目标用户群体又有着非常高的重合度，所以我相信，我们的联手会给双方都带来更多机会。

 

关于趣分期

趣分期是深受中国大学生同学们喜爱的大学生分期商城。于2014年3月21日启动，一上线即受到全国大学生同门喜爱，目前已经在全国数百个城市数千所大学开展分期购物业务。

他们将用户体验放在第一位，致力于为大学生提供分期购物服务，培养合理的消费观念。而如果购物后还款有困难，更将提供兼职岗位，促进大学生提前独立。

全网购物，分期付款，尽一切努力方便同学们购物，这，就是趣分期。

 


关于i-rocks

艾芮克股份有限公司（i-rocks Technology）是中国台湾以自有品牌I-ROCKS行销全球的电脑周边厂商，一直为客户提供高品质电脑周边创新的输出装置。自成立以来，即不断投注创新精神与研发及行销努力，提供完善及附加价值产品，以满足客户全方位的需求。

i-rocks参与第一届的i联赛众筹赞助后，在第二届i 联赛中不仅赞助不变，更是拿出了更多更好的实物回馈提供给广大参与众筹的玩家们，无论是精美的鼠标还是帅气的键盘，都让我们由衷的感谢他们对于i 联赛的不懈支持。"},
              { title: "大型电竞真人秀《游戏麦霸我最6》3月7日首播", content: "有这样一批人，

他们每天面对电脑聚精会神，

他们手指修长犹如钢琴弹奏，

他们苦思冥想宛若老僧入定，

他们在各自的领域都是叱咤风云的存在，

振臂一呼应者如云。

但，他们的背后都有不为人知的一面，

灵魂歌手！





　　我们见惯了大神在游戏中厮杀，可曾见过他们在麦前嘶吼？

　　如今，ImbaTV邀请DOTA2与炉石巨星倾情加盟，谁才是打游戏里唱歌唱的最好的，谁又是游戏里的钢琴师生活里的噪音机，是文武双全人美歌甜，还是五音不全闻着心碎，让我们锁定ImbaTV全新歌唱类节目《游戏麦霸我最6》，见证游戏圈内歌神麦霸的诞生！

　　谁是游戏界的歌神麦霸，谁是电竞圈的灵魂歌手，除了游戏的另一面，谁才能突出重围一枝独秀，关注3月7号，8号晚7点档，《电竞麦霸我最6》，ImbaTV带你一起转身！ "},
              { title: "第三届i联赛DOTA2项目规则赛制", content: "出线名额分配：

上届冠军：LGD战队    中国赛区：4队   

东南亚赛区：1队    欧洲赛区：1队     美洲赛区：1队

赛制：

1线上预选赛：

⑴中国赛区：

① 第一阶段：公开报名赛，所有报名队伍分两组进行BO1单败淘汰赛(小组决赛BO3)，每个小组决出一支队伍，进入第二阶段。

② 第二阶段：将14支邀请队伍与第一阶段胜出的两支队伍分为两个小组进行单循环BO2积分赛（胜一场积1分），小组积分最高的两支队伍直接取得出线资格（出现同分依次比较：a.同分队伍间胜负关系；b.胜利场次所用时间；与非同分队伍的比赛不计算在内，胜场高的排名靠前，胜利场次所用时间较少的排名靠前）。

⑵非中国赛区：

邀请8支职业队伍，进行BO3单败淘汰赛，优胜者取得线下赛资格。

2线下正赛：8强双败淘汰赛，总决赛BO5（胜者组冠军有优先选边权，无胜场优势），其余BO3。

奖金设置：基础奖金2,000,000元人民币+众筹所得*70%+门票销售所得(ImbaTV所有分成部分)

1st. 50%      2nd. 20%   

3rd. 13%            4th. 7%    

5th. 3.5%              6th. 3.5%  

7th. 1.5%              8th. 1.5%

 

比赛设置：

　　1.客户端：Dota2（Steam平台/完美国服客户端）

　　2.比赛版本：比赛当日客户端的锦标赛版本

3.观众观战选择：i-league S3

4.主机选择：

在双方无法达成一致时分赛区默认服务器如下：中国赛区——电信服务器；美洲赛区——美东服务器；欧洲赛区——卢森堡服务器；东南亚赛区——新加坡服务器。

 

比赛规则：
　　1. 胜利方式：对方有任何一人认输打出GG或者摧毁对方基地；

　　2. 比赛模式：队长模式

3. 阵营/BP顺序选择：在主机内由双方场上队长进入AP模式各自选择随机英雄，按照随机出来英雄的生命值高低判定获胜方，如生命值相同则比较初始护甲。由获胜一方选择先BAN或者阵营，失利一方选择另一项；BO3的比赛，第一盘和第三盘BP顺序相同；BO5的比赛，第一盘、第三盘和第五盘的BP顺序相同。

　　4. 允许借给同一路的队友恢复性物品：由游戏内规定为准；

　　5. 允许共享游戏默认可以共享的物品；

　　6 比赛暂停不允许在双方交战过程中发生，任何一方违反次规定将被予以警告，警告无效后，裁判有权判负本场比赛。

　　7. 若出现冒名顶替、代打、假赛、作弊等有违比赛公平原则的情况，一经查实，将直接取消此选手本赛季所有比赛成绩与参赛资格，并在以后的赛季中考虑其参赛资格，或依据《i联赛-团队项目管理规定》第22条判罚；

主机选择：
　　1. 线上比赛参赛队伍的联系人必须最晚在比赛正式开始15分钟前到比赛群报道；

　　2. 比赛正式开始前30分钟内，为主机测试时间，若参赛队伍（包括个别迟到的战队成员）未在上述规定的时间全部进入比赛主机，将按照以下方式进行处理；线上比赛未按时进入主机，视作放弃主机测试权利；线下比赛开始前30分钟--20分钟未到，扣除30秒BP时间；比赛开始前20分钟--10分钟未到，扣除70秒BP时间；比赛开始前10分钟未到，扣除110秒BP时间。比赛规定开始时间仍未到的，将被视为战队放弃本场比赛。

　　3. 线下比赛服务器默认为完美世界（电信）服务器（服务器出现故障将视情况选择本地房间或其他网络条件可以接受的服务器）。赛前，战队管理者有义务积极与对方参赛战队提前确定网络情况，若在主机测试的规定时间内双方在主机问题上无法达成一致意见，将强制使用完美世界（电信）进行比赛，双方不得异议；

　　4. 主机测试完成以后，双方所有战队成员必须在已建立的比赛主机中等待，正式比赛时间过后，将不再等待没有在比赛主机中出现的战队成员（无论是未到、重新调整计算机，还是更新游戏补丁），将被视为放弃本场比赛，战队将以剩下的成员完成比赛，若当时战队成员总人数少于4人，将被视为战队放弃本场比赛；

游戏掉线说明：

　　1. 因计算机配置不同等相关原因，战队成员应提前做好网吧等地的赛前游戏测试工作，因机器配置或选手自身网络问题导致比赛无法正常进行的，将被视为该选手放弃本场比赛；

　　2. 比赛正式开始后，如有双方负责BP的选手在Ban/Pick阶段掉线，则掉线方有权选择重新BP，但双方之前的BP结果必须完全还原。

　　3. 比赛正式开始后，如果发生队员掉线或者其他意外情况，双方各有3次要求暂停游戏，等待掉线队员断线重连的权利，超过次数限制或单次暂停时间超过5分钟将无权再要求重新游戏，以场上剩余成员完成比赛；其余情况下需要暂停，场上队长需在公聊频道提出或者举手示意，在裁判许可的情况下，由裁判进行操作，暂停时间都不得超过5分钟，任何场上选手的私自暂停将会收到警告等处罚；依据《i联赛-团队项目管理规定》第23条；

　　4. 如遇到服务器崩溃，无法重新连回服务器，则按照以下规则处理：游戏崩溃发生在10分钟以内，双方必须重新开始游戏。重新开始后，双方必须选取Ban/Pick阶段选择的英雄进行比赛，任何已经发生的动作，例如：物品购买、技能学习、首发路线、First Blood等都必须按照之前的状态复原；如游戏崩溃发生在10分钟以上且无法恢复的，参考一血、击杀数、失塔数、兵营等进行判罚（每个击杀1分、防御塔3分、兵营5分、复活盾2分、一血2分，总分超过20分即可判定为巨大优势），若无法立即得出判罚结果的，将按照《2.1团队项目管理规定》第25、26条进行处理；

　　5. 任何利用游戏Bug，导致客户端出错的情况，一经发现立即判负，赛事组委会将不会接受任何“不清楚、不知道、不小心”等理由；

　　6. 频繁掉线，会收到裁判的警告；

　　7. 场上裁判或者转播OB掉线，必须暂停等待OB重载游戏。

比赛限制：

　　1. 允许共享操作；
　　2. 允许杀死队友；
　　3. 物品限制：无；
　　4. 越位Back Door限制：无；
　　5. 禁止利用游戏中的漏洞及Bug；
　　6. 严禁使用任何DOTA2作弊软件；

犯规处罚：

　　1. 裁判负责对整场比赛的监控，并对违规行为做出判罚。情节严重的直接判负，而情节较轻的予以警告，受到超过一次以上警告视为直接判负；

　　2. 此规则中未列明的其他相关处罚规定，以《i联赛-管理规定－总则》和《i联赛-团队项目管理规定》内附条例为准；

　　3. 若对判罚结果不满，可向裁判长在赛后24小时内提出申诉；

　  i联赛赛事组委会保留在提前通知的情况下，对上述规则进行改动的权利，并保留对上述规则的最终解释权；"},
              { title: "第三届i联赛炉石传说项目规则赛制", content: "一、报名规则：


1、业余组：通过业余组报名入口下分的8个主播报名入口报名，每个主播入口报名上限64人，报满截止。报名要求：姓名，年龄，身份证号，手机号，QQ号，最好天梯成绩或比赛成绩。（要求天梯等级达到过5级或5级以上。）


2、职业组：通过职业组报名入口报名，上限为48人。报名要求：姓名，年龄，身份证号，手机号，QQ号，最好天梯成绩或比赛成绩（要求在国家级及世界级比赛中取得前8名次，或上月天梯成绩为国服前100。） 


所有参赛选手只能选择一个组别报名，一经发现重复报名，则取消其比赛资格。




二、赛程安排：
 
线上赛：线上赛分为4部分，包括业余组选拔赛，专业组选拔赛，线上正赛。

1.1业余组选拔赛：玩家公开报名，由斗鱼主播选拔，8名主播各自选拔4名业余选手共32人，主播必须提供选拔过程的录像，截图，或直播选拔过程。8名主播各自带队抽签进行对抗，以队与队4人KOF赛制单淘胜出2队共8人晋级线上正赛。（8名主播对各自队伍负责，一经发现代打或报牌等作弊行为，取消全队比赛资格，包括主播的职业组邀请资格。）


赛制：KOF,每队4人不限套牌，胜者队不允许更换套牌，败者队可随意选择队员及套牌应战，直至一方4人全部败北。


1.2专业组选拔赛：48人抽签分为24组，单淘KOF3出线24人。（征服模式）


1.3线上正赛：32人（业余组选拔赛出线2队共8人+专业组选拔赛出线24人）分为8组，进行小组单循环KOF3比赛，小组前2出线（大场胜利积1分，失败0分，平分排位顺序：胜负关系——净胜场数，全部相同进行加赛，加赛KOF3），16强单淘决出晋级线下8强名额。（征服模式）


2、线下赛：出线8人随机抽签进行双败KOF5淘汰赛，决出胜败者组冠军晋级最后总决赛。


3、总决赛：KOF9。（征服模式）



三、比赛规则：

1.线上赛阶段选手需在比赛前15分钟在比赛群签到并添加当值裁判好友，并通过QQ提交当天比赛所用卡组，迟到及比赛时更换卡组均作判负处理。


2.比赛不允许代打或报牌等作弊行为，一经发现取消比赛资格。


3.任意在比赛过程中的掉线或游戏崩溃行为，在无法重连的情况下均做判负处理。


4.所有线上直播比赛选手需自备画面清晰的第一视角即时影像。




征服模式规则：


比赛为KOF3（5），率先获得三（五）场对局胜利者赢得比赛。


每个选手必须事先递交三（五）副不同职业的卡组。


赢得比赛的选手，其每副卡组都必须、且只能赢得一场对局。


当一名选手使用一副卡组取得了一场对局的胜利，他不得再使用这副获胜过的卡组。


当场对局的败者，在下局中，可以选择更换卡组，也可以选择不更换卡组。


比赛进行中时，双方都会被告知对手哪些职业是可用的，但不会被告知对手下局对决中会选择哪个职业，直到比赛开始。


四、赛事奖金：

冠军 ￥80000

亚军 ￥40000

季军 ￥20000

殿军 ￥12000

5-6名 ￥8000

7-8名 ￥5000


五、比赛时间

报名时间：3月9日-3月22日

比赛时间：4月1日-5月31日

本赛事最终解释权归ImbaTV所有。
"},
              { title: "i联赛炉石传说项目报名延期公告", content: "由于报名人数过多，i联赛炉石传说项目将原定于3月9日开启的报名日期延期至3月21日，用于应对海量报名人数的后台调整，已报名的玩家信息已经录入，不用在报名系统开启后重复报名，其他未报名玩家可在报名重新开启后继续登陆http://i.imbatv.cn/register.php参与报名，敬请各位知晓。"},
              { title: "第三届i联赛开始报名啦!", notify: true, content: "2015年伊始，LGD战队以3:0的比分完胜HGT战队斩获i联赛第二赛季冠军，将自己的名字镌刻在了i联赛的历史之中，如今春风吹过，在此万物复苏之际，i联赛第三赛季再度起航，我们将延续第二赛季的报名方式，期待更多玩家一起加入i联赛的竞技舞台！

　　报名地址：http://i.imbatv.cn/register.php
　　报名日期：3月9日-3月22日
　　出线名额分配：
　　上届冠军：LGD战队   中国赛区：4队
　　东南亚赛区：1队    欧洲赛区：1队     美洲赛区：1队"} ])

Program.create([
                  { datatime: "2015-03-05 晚上7点00", content: "游戏麦霸我最6: 蒙太奇"},
                  { datatime: "2015-03-07 晚上7点00", content: "游戏麦霸我最6: infi"},
                  { datatime: "2015-03-09 晚上7点00", content: "游戏麦霸我最6: SDN"},
                  { datatime: "2015-03-11 晚上7点00", content: "游戏麦霸我最6: 鬼鬼"},
                  { datatime: "2015-03-13 晚上7点00", content: "游戏麦霸我最6: 喵小梦"},
                  { datatime: "2015-03-15 晚上7点00", content: "游戏麦霸我最6: 囚徒"},
                  { datatime: "2015-03-17 晚上7点00", content: "游戏麦霸我最6: 29"},
                  { datatime: "2015-03-19 晚上7点00", content: "游戏麦霸我最6: 马甲哥"} ])

News.order(created_at: :desc).take(8).each do |news|
  news.comments.create!(commenter: "巨魔", body: "看上去不错的样子!")
  news.comments.create!(commenter: "JUGG", body: "ZZWDJS")
  news.comments.create!(commenter: "敌法师", body: "嗯.")
  news.comments.create!(commenter: "卡尔", body: "还好吧")
  news.comments.create!(commenter: "430", body: "呵呵")
  news.comments.create!(commenter: "神灵武士", body: "不错!")
end